# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)
# string- არის ბრჭყალები და ის გამოიყენება ტექსტური ინფორმაციის შესანახად.
# integer- არის მთელი რიცხვები და გამოიყენება რიცხვითი ინფორმაციის შესანახად.
# float- არის ათწილადი რიცხვი.





# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.
#ცვლადი-VARIAbLES ადგილი სადაც ინახება მონაცემები



# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.



print("Hello")
print("World")
print("Python")
print("Programming")
print("chad")
print(1)
print(2)
print(3)
print(67)
print(89)  
print(1.5)
print(2.3)
print(3.7)
print(6.7)
print(3.7737737373)






# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.

name="nikolozi"
course="goa"
word="becoming"
text="chad" 
word_1="In"
print(name, "is", word, text, word_1, course)











# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.
print(10+5)
print(10-5)
print(10*5)
print(10//5)

print(3+4)
print(3-4)
print(3*4)  
print(3//4)


print(7+8)
print(7-8) 
print(7*8)
print(7//8) 





# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

num_1=10
num_2=10
num_3=10
print(num_1+num_2+num_3)






